Revit 2027 API
BoundaryValidation Methods
The BoundaryValidation type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidBoundaryOnSketchPlane |  Indicates if the given curve loops compose a valid boundary on the sketch plane.
IsValidBoundaryOnView |  Indicates if the given curve loops compose a valid boundary on the view's detail sketch plane.
IsValidHorizontalBoundary |  Identifies whether the given curve loops compose a valid horizontal boundary.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
BoundaryValidation Class
Autodesk.Revit.DB Namespace